[[CodeRW]]
Рассмотрим три числа aa, bb и cc. Упорядочим их по возрастанию.

Какое число будет стоять между двумя другими?

Решение этой задачи на С++ могло бы выглядеть так:

```
#include <iostream>
#include <algorithm>

using namespace std;

int main()
{
    int a[3];
    for (int i = 0; i < 3; ++i) cin >> a[i];
    sort(a, a + 3);
    cout << a[1] << endl;
    return 0;
}
```

## Формат ввода

В единственной строке записаны три целых числа a, b, c (−1000≤a,b,c≤1000), числа разделены одиночными пробелами.

## Формат вывода

Выведите число, которое будет стоять между двумя другими после упорядочивания.

## Пример 1

Ввод

```
1 2 3
```

Вывод

```
2
```

## Пример 2

Ввод

```
1000 -1000 0
```

Вывод

```
0
```

## Пример 3

Ввод

```
3 1 3
```

Вывод

```
3
```

### Решение

```java ignore
import java.util.Arrays;  
import java.util.Scanner;  
  
public class Main {  
    public static void main(String[] args) {  
        // Создаем объект Scanner для чтения ввода с клавиатуры  
        Scanner scanner = new Scanner(System.in);  
        
        // Считываем строку с вводом  
        String input = scanner.nextLine();  
        
        // Разделяем строку на части по пробелам  
        String[] stringarray = input.split(" ");  
        
        // Создаем массив целых чисел такого же размера  
        int[] array = new int[stringarray.length];  
        
        // Преобразуем строки в числа и сохраняем в массив  
        for (int i = 0; i < stringarray.length; i++) {  
            array[i] = Integer.parseInt(stringarray[i]);  
        }  
        
        // Сортировка массива  
        Arrays.sort(array);  
        
        // Выводим центральное число  
        System.out.println(array[1]);  
    }  
}
```